title: HH.EXE Execution of CHM Files
id: f1902574-6e9e-43ae-869a-5c2dfd8f9184
status: stable
description: >-
  This rule detects the execution of 'hh.exe' (Microsoft HTML Help Executable)
  specifically when it is used to open '.chm' (Compiled HTML Help) files.
  Adversaries often abuse 'hh.exe' to execute malicious code embedded within CHM
  files as a defense evasion technique, leveraging a legitimate system binary to
  proxy execution.
references:
  - >-
    https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218.001/T1218.001.md
  - >-
    https://eqllib.readthedocs.io/en/latest/analytics/b25aa548-7937-11e9-8f5c-d46d6d62a49e.html
  - >-
    https://www.zscaler.com/blogs/security-research/unintentional-leak-glimpse-attack-vectors-apt37
author: Luís Marques, SIBS Cyberwatch @remotecodeexecution
date: 2026-03-24T00:00:00.000Z
tags:
  - attack.defense-evasion
  - attack.t1218.001
logsource:
  category: process_creation
  product: windows
  service: security
detection:
  selection_img:
    - OriginalFileName: HH.exe
    - Image|endswith: \hh.exe
  selection_cli:
    CommandLine|contains: .chm
  groupby:
    - sha256: '*'
  condition: all of selection_*
falsepositives:
  - False positives are expected with legitimate ".CHM" file usage, as hh.exe is
    a legitimate Windows component.
level: low
