title: Axios Compromised Package
id: f3d67881-5840-43e0-a4a8-e54ef6652241 
status: stable
description: |
  Detects the installation or execution of compromised npm packages related to
  the Axios supply chain attack, with execution or reference to the dropped
  macOS RAT payload.
author: Luís Marques, SIBS Cyberwatch @remotecodeexec
references:
  - https://www.stepsecurity.io/blog/axios-compromised-on-npm-malicious-versions-drop-remote-access-trojan#indicators-of-compromise
date: 2026-03-31
tags:
  - attack.execution
  - attack.t1195.002
  - attack.t1059.004
logsource:
  product: any
  category: process_creation
detection:
  selection_eventcode:
    EventID: 1
  selection_npm_cmd:
    CommandLine|contains:
      - 'npm install '
      - 'npm i '
      - 'npm list '
      - 'npm ls '
      - 'npx '
      - 'yarn add '
      - 'pnpm add '
      - 'pnpm install '
  selection_npm_pkg:
    CommandLine|contains:
      - axios
      - plain-crypto-js
      - openclaw
  selection_domain:
    DestinationHostName|contains: 
      - 'sfrclak.com'
      - 'packages.npm.org'
  selection_dropped_payload_folders:
    CommandLine|contains:
      - 'PROGRAMDATA'
      - 'TEMP'
      - 'tmp'
      - 'Library/Caches'
  selection_dropped_payload_execution:
    CommandLine|contains:
      - 'wt.exe'
      - '.vbs'
      - '.ps1'
      - 'ld.py'
  selection_ip:
    DestinationIp: '142.11.206.73'
  condition: (selection_npm_cmd and selection_npm_pkg) or selection_domain or selection_ip or (selection_dropped_payload_folders and selection_dropped_payload_execution)
falsepositives:
  - Security researchers or automated analysis sandboxes analyzing the
    compromised packages as part of response.
level: high
