title: Malicious C2 for a Wiper via Microsoft lookalike domains
id: bbc79c0a-97d0-4ff2-bdef-57976b322ac5
status: stable
description: |
    Detects the use of Microsoft lookalike domains for command and control (C2) communication in the context of wiper malware. 
    Attackers may register domains that closely resemble legitimate Microsoft domains to evade detection and facilitate malicious activities, such as data exfiltration or remote control of compromised systems.
author: Luís Marques, SIBS Cyberwatch @remotecodeexec
date: 2026-03-17
tags:
  - attack.impact
  - attack.t1485
  - attack.t1529
logsource:
  category: network_connection 
detection:
  selection_event:
    EventID|contains: 'DNS'

  selection_uri:
    uriStem|contains: 
      - "apps.gist.githubapp.net"
      - "githubapp.net"
      - "api.gupdate.net"
      - "gupdate.net"
      - "login.forticloud.online"
      - "fortigate.forticloud.online"
      - "cloud.sophos.one"
  
  selection_query:
    uriQuery|contains: 
      - "apps.gist.githubapp.net"
      - "githubapp.net"
      - "api.gupdate.net"
      - "gupdate.net"
      - "login.forticloud.online"
      - "fortigate.forticloud.online"
      - "cloud.sophos.one"

  selection_referer:
    httpReferrer|contains: 
      - "apps.gist.githubapp.net"
      - "githubapp.net"
      - "api.gupdate.net"
      - "gupdate.net"
      - "login.forticloud.online"
      - "fortigate.forticloud.online"
      - "cloud.sophos.one"

  condition: selection_event and (selection_uri or selection_query or selection_referer)
level: high