title: Network Connection Initiated By Script Interpreter
status: stable
description: Detects a script interpreter wscript/cscript opening a network connection to a non-local network. Adversaries may use script to download malicious payloads.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/28d190330fe44de6ff4767fc400cc10fa7cd6540/atomics/T1105/T1105.md
author: Luís Marques, SIBS Cyberwatch @remotecodeexec
date: 2026-03-13
modified: 2026-03-16
tags:
    - attack.command-and-control
    - attack.t1105
logsource:
    category: network_connection
    product: windows
    service: sysmon
detection:
    selection:
        Initiated: 'true'
        Image|endswith:
            - '\wscript.exe'
            - '\cscript.exe'
        EventID: 3    
    groupby:
        - dst_port: '*'
        - CommandLine: '*'
        - src_ip: '*'
        - dst_ip: '*'
    condition: selection
falsepositives:
    - Legitimate scripts
level: high