title: Remote PowerShell Sessions Network Connections with WinRM
status: stable
description: Detects basic PowerShell Remoting (WinRM) by monitoring for network inbound connections to ports 5985 OR 5986
references:
    - https://threathunterplaybook.com/hunts/windows/190511-RemotePwshExecution/notebook.html
author: Luís Marques, SIBS Cyberwatch @remotecodeexec
date: 2019-09-12
modified: 2026-03-09
tags:
    - attack.execution
    - attack.t1059.001
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 5156
        DestPort:
            - 5985
            - 5986
        LayerRTID: 44
    groupby:
        - src_ip: '*'
        - dst_ip: '*'
        - user: '*'
    condition: selection
falsepositives:
    - Legitimate use of remote PowerShell execution
level: high