let Lookback = 24h;
let OauthMSPhish =
EmailUrlInfo
| where Timestamp > ago(Lookback)
| where UrlDomain matches regex @"index-[a-z0-9]+(\.[a-z0-9\-]+)*\.workers\.dev"
| join EmailEvents on NetworkMessageId
| where EmailDirection == "Inbound"
| where DeliveryAction <> "Blocked";
DeviceNetworkEvents
| where ReportId != "0"
| where Timestamp > ago(Lookback)
| where RemoteUrl matches regex @"index-[a-z0-9]+(\.[a-z0-9\-]+)*\.workers\.dev"
| union OauthMSPhish
| project-rename 
    ReportId=ReportId_string