title: Windows Multiple Accounts Disabled
id: 5d93894e-befa-4429-abde-7fc541020b7b
status: production
description: The following analytic identifies instances where more than five unique Windows accounts are disabled within a 10-minute window, as indicated by Event Code 4725 in the Windows Security Event Log. It leverages the wineventlog_security dataset, grouping data into 10-minute segments and tracking the count and distinct count of TargetUserName. This behavior is significant as it may indicate internal policy breaches or an external attacker's attempt to disrupt operations. If confirmed malicious, this activity could lead to widespread account lockouts, hindering user access and potentially disrupting business operations.
author: Mauricio Velazco, Splunk
date: '2025/05/02'
references:
  - https://attack.mitre.org/techniques/T1098/
tags:
  - attack.persistence
  - attack.t1098
  - attack.t1078
logsource:
  product: windows
  service: security
detection:
  selection:
    EventCode: 4725
    status: 'success'
  timeframe: 10m
  groupby:
    - SubjectDomainName
    - TargetDomainName
    - Logon_ID
  aggregation:
    unique_users: count(distinct TargetUserName)
  condition: selection and unique_users > 5
falsepositives:
  - Service accounts may be responsible for the creation, deletion or modification of accounts for legitimate purposes. Filter as needed.
level: medium
