title: Suspicious Ping and Del Command Combination
id: 4c09bd16-5252-45a9-bb9e-fadcb3c5af24
status: stable
description: >-
  Detects a method often used by ransomware and other malware, which combines
  the "ping" command to wait a couple of seconds (acting as a sleep command) and
  then "del" to delete the file in question. This is commonly used to hide or
  delete the file responsible for the initial infection.
author: Luís Marques, SIBS Cyberwatch @remotecodeexecution
references:
  - >-
    https://www.manageengine.com/log-management/detection-rules/suspicious-ping-del-command-combination.html#detections
date: 2026-04-01T00:00:00.000Z
tags:
  - attack.defense-evasion
  - attack.t1070.004
logsource:
  category: process_creation
  product: windows
detection:
  selection_base:
    CommandLine|contains|all:
      - ping
      - nul
      - 'del '
  selection_n:
    CommandLine|contains:
      - ' -n'
      - ' /n'
      - ' –n'
      - ' —n'
      - ' ―n'
  selection_flags:
    CommandLine|contains:
      - ' -f'
      - ' /f'
      - ' –f'
      - ' —f'
      - ' ―f'
      - ' -q'
      - ' /q'
      - ' –q'
      - ' —q'
      - ' ―q'
  condition: selection_base and selection_n and selection_flags
falsepositives:
  - Administrator scripts or automated deployment tools that perform cleanup
    after an installation or update process.
level: medium
