title: System Network Connections Discovery Via Net.EXE
status: stable
description: Adversaries may attempt to get a listing of network connections to or from the compromised system they are currently accessing or from remote systems by querying for information over the network.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1049/T1049.md#atomic-test-1---system-network-connections-discovery
author: Luís Marques, SIBS Cyberwatch @remotecodeexecution
date: 2021-12-10
modified: 2023-02-21
tags:
    - attack.discovery
    - attack.t1049
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith:
              - '\net.exe'
              - '\net1.exe'
        - OriginalFileName:
              - 'net.exe'
              - 'net1.exe'
    selection_cli:
        - CommandLine|endswith:
              - ' use'
              - ' sessions'
        - CommandLine|contains:
              - ' use '
              - ' sessions '
    groupby:
        CurrentDirectory: '*'
        User: '*'
    condition: all of selection_*
falsepositives:
    - Legitimate activity of net.exe and net1.exe with the 'use' and 'sessions' parameters by administrators and users with elevated privileges
level: low
